# jupyter 사용법
* h : help
* a, b : 셀 추가
* m, y : 마크다운, 코드
* dd : 한 줄 삭제
* Ctrl + Enter : 실행

# pandas
- 특정 데이터들을 DataFrame 형식으로 변환

In [5]:
import pandas as pd

In [6]:
df = pd.read_csv("../data_set/1.pandas/1.pandas.csv");

In [7]:
df

   name  score grade  age
0   Kim  100.0     A   20
1   Cho   95.0     A   30
2  Choi   90.5     B   40
3    jo   85.7     B   50

In [9]:
#df['name'] 보편적으로 이 코드를 더 많이 사용
df.score

0    100.0
1     95.0
2     90.5
3     85.7
Name: score, dtype: float64

In [11]:
df[['name', 'age']]

   name  age
0   Kim   20
1   Cho   30
2  Choi   40
3    jo   50

In [14]:
df[1:]

   name  score grade  age
1   Cho   95.0     A   30
2  Choi   90.5     B   40
3    jo   85.7     B   50

---
# loc 
* 열 또는 특정 조건의 값을 얻어온다.
* df.loc[행(index), 열(column조건식)]

In [15]:
df.loc[1:3, 'name']

1     Cho
2    Choi
3      jo
Name: name, dtype: object

In [17]:
df.loc[1:3, ['name']] #데이터 프레임 형식으로 값 가져오기

   name
1   Cho
2  Choi
3    jo

In [18]:
df[1:4]['name'] #df.loc[1:3, 'name'] 와 동일하게 출력

1     Cho
2    Choi
3      jo
Name: name, dtype: object

In [19]:
df[1:4][['name']] #데이터 프레임 형식으로 값 가져오기

   name
1   Cho
2  Choi
3    jo

In [20]:
df[1:4][['name', 'age']]

   name  age
1   Cho   30
2  Choi   40
3    jo   50

In [21]:
df.loc[1:3, ['name','age']]

   name  age
1   Cho   30
2  Choi   40
3    jo   50

In [23]:
df.loc[ : , 'name':'grade'] # 처음부터 끝까지, name컬럼부터 grade컬럼까지의 값 가져오기

   name  score grade
0   Kim  100.0     A
1   Cho   95.0     A
2  Choi   90.5     B
3    jo   85.7     B

In [25]:
df.loc[1:2, ] # 1번부터 2번 인덱스, 모든 값 가져오기

   name  score grade  age
1   Cho   95.0     A   30
2  Choi   90.5     B   40

In [27]:
df['grade']=='A' # 해당 열 전부 비교

0     True
1     True
2    False
3    False
Name: grade, dtype: bool

In [28]:
df

   name  score grade  age
0   Kim  100.0     A   20
1   Cho   95.0     A   30
2  Choi   90.5     B   40
3    jo   85.7     B   50

In [30]:
df[df['grade']=='A'] # df[]안의 내용이 True 인 것만 꺼내온다.

  name  score grade  age
0  Kim  100.0     A   20
1  Cho   95.0     A   30

In [34]:
df = pd.read_csv('../data_set/4.분류/titanic_cleaning.csv')
df.head() # head() : 위에서부터 5줄의 값 가져오기

   PassengerId  Survived  Pclass  Sex   Age  SibSp  Parch     Fare
0            1         0       3    0  22.0      1      0   7.2500
1            2         1       1    1  38.0      1      0  71.2833
2            3         1       3    1  26.0      0      0   7.9250
3            4         1       1    1  35.0      1      0  53.1000
4            5         0       3    0  35.0      0      0   8.0500

In [35]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch',
       'Fare'],
      dtype='object')

In [36]:
label = 'Survived' # 정답
features = ['Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare'] # 문제(비교값)

In [37]:
X = df[features]
X # 문제에 대한 결과

     Pclass  Sex        Age  SibSp  Parch     Fare
0         3    0  22.000000      1      0   7.2500
1         1    1  38.000000      1      0  71.2833
2         3    1  26.000000      0      0   7.9250
3         1    1  35.000000      1      0  53.1000
4         3    0  35.000000      0      0   8.0500
..      ...  ...        ...    ...    ...      ...
886       2    0  27.000000      0      0  13.0000
887       1    1  19.000000      0      0  30.0000
888       3    1  29.699118      1      2  23.4500
889       1    0  26.000000      0      0  30.0000
890       3    0  32.000000      0      0   7.7500

[891 rows x 6 columns]

In [38]:
X = df[features]
y = df[label]
y # 정답에 대한 결과

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [39]:
# 학습을 시키기 전에 우리가 만든 알고리즘이 잘 만들어진 것인지 확인하는 과정 필요 
from sklearn.model_selection import train_test_split

In [40]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2) # train : 학습용(학습에 대한 정답), test : 검증용

In [41]:
df.shape #전체 데이터 정보(891개의 데이터, 8개의 컬럼)

(891, 8)

In [42]:
X_train.shape

(712, 6)

In [43]:
X_test.shape

(179, 6)

In [44]:
from sklearn.ensemble import RandomForestClassifier 
r = RandomForestClassifier()

In [45]:
r.fit(X_train, y_train) # 정답과 문제를 학습시킨다.

RandomForestClassifier()

In [47]:
r.score(X_test, y_test) # 얼마나 맞출 수 있는지 확인 > 82%

0.8212290502793296

In [50]:
r.predict(X_test) # 문제를 주면 그거에 대한 결과값을 알려준다. 예측한 정답 출력

array([0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 1, 1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0,
       1, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 1, 1,
       1, 1, 1, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0,
       0, 1, 0, 1, 0, 0, 1, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 1, 0, 1, 1, 0,
       1, 1, 0, 0, 1, 1, 1, 0, 0, 0, 1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0,
       1, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 0,
       1, 1, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 1, 1, 0, 0, 1,
       0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 1, 1, 1, 1, 0, 0, 1, 0, 0, 0, 1, 1,
       0, 0, 0], dtype=int64)

In [49]:
y_test #정답지 출력

775    0
807    0
266    0
232    0
771    0
      ..
580    1
52     1
861    0
233    1
714    0
Name: Survived, Length: 179, dtype: int64

In [51]:
user = [[1, 0, 25.0, 2, 0, 80.12]]
r.predict(user)

C:\Users\user\anaconda3\Lib\site-packages\sklearn\base.py:439: UserWarning: X does not have valid feature names, but RandomForestClassifier was fitted with feature names
  warnings.warn(

array([0], dtype=int64)

In [54]:
user = [[1, 0, 25.0, 2, 0, 80.12]]
result = r.predict(user)
result[0] # 죽는지, 사는지에 대한 결과 값 출력

C:\Users\user\anaconda3\Lib\site-packages\sklearn\base.py:439: UserWarning: X does not have valid feature names, but RandomForestClassifier was fitted with feature names
  warnings.warn(

0

In [53]:
user = [[1, 0, 25.0, 2, 0, 80.12]]
result = r.predict(user)
if result[0]==0:
    print("오늘은 좋은 일이 생기실 거에요~^^")
else:
    print("생존을 축하합니다!")

오늘은 좋은 일이 생기실 거에요~^^

C:\Users\user\anaconda3\Lib\site-packages\sklearn\base.py:439: UserWarning: X does not have valid feature names, but RandomForestClassifier was fitted with feature names
  warnings.warn(

In [55]:
df = pd.read_csv("../data_set/1.pandas/1.pandas.csv");
df

   name  score grade  age
0   Kim  100.0     A   20
1   Cho   95.0     A   30
2  Choi   90.5     B   40
3    jo   85.7     B   50

In [56]:
df.drop(2)

  name  score grade  age
0  Kim  100.0     A   20
1  Cho   95.0     A   30
3   jo   85.7     B   50

In [57]:
df

   name  score grade  age
0   Kim  100.0     A   20
1   Cho   95.0     A   30
2  Choi   90.5     B   40
3    jo   85.7     B   50

In [58]:
df = df.drop(2)
df

  name  score grade  age
0  Kim  100.0     A   20
1  Cho   95.0     A   30
3   jo   85.7     B   50

In [59]:
df

  name  score grade  age
0  Kim  100.0     A   20
1  Cho   95.0     A   30
3   jo   85.7     B   50

In [60]:
df.drop(1, inplace=True)

In [61]:
df

  name  score grade  age
0  Kim  100.0     A   20
3   jo   85.7     B   50

---
# axis
* 열 또는 행 중에 어떠한 값을 기준으로 설정할 지
* axis는 기본적으로 행(index)으로 설정되어 있다. axis = 0
* axis = 1 : 열(column) 기준
* axis = 0 : 행(index) 기준
---

In [67]:
df.drop(0, axis=0, inplace=True) # 0번째 행 삭제 후 자기 자신에게 바로 적용
df

   name  score grade  age
1   Cho   95.0     A   30
2  Choi   90.5     B   40
3    jo   85.7     B   50

In [65]:
df.drop('score', axis=1, inplace=True)
df

  name grade  age
3   jo     B   50

In [68]:
df = pd.read_csv("../data_set/1.pandas/1.pandas.csv");
df

   name  score grade  age
0   Kim  100.0     A   20
1   Cho   95.0     A   30
2  Choi   90.5     B   40
3    jo   85.7     B   50

In [69]:
df['score'] < 95

0    False
1    False
2     True
3     True
Name: score, dtype: bool

In [70]:
df[df['score'] < 95]

   name  score grade  age
2  Choi   90.5     B   40
3    jo   85.7     B   50

In [71]:
df[df['score'] < 95]['name']

2    Choi
3      jo
Name: name, dtype: object

In [72]:
df.loc[df['score'] < 95, ]

   name  score grade  age
2  Choi   90.5     B   40
3    jo   85.7     B   50

In [73]:
df.loc[df['score'] < 95,['name']]

   name
2  Choi
3    jo

In [74]:
df[df['score'] < 95][['name', 'age']]

   name  age
2  Choi   40
3    jo   50

In [75]:
df.loc[df['score'] < 95,['name', 'age']]

   name  age
2  Choi   40
3    jo   50

In [76]:
df

   name  score grade  age
0   Kim  100.0     A   20
1   Cho   95.0     A   30
2  Choi   90.5     B   40
3    jo   85.7     B   50

In [77]:
df.columns

Index(['name', 'score', 'grade', 'age'], dtype='object')

In [78]:
df.values

array([['Kim', 100.0, 'A', 20],
       ['Cho', 95.0, 'A', 30],
       ['Choi', 90.5, 'B', 40],
       ['jo', 85.7, 'B', 50]], dtype=object)

In [80]:
df.dtypes # object : String, 자료형을 보여줌

name      object
score    float64
grade     object
age        int64
dtype: object

In [81]:
df['grade'].isin(['A'])

0     True
1     True
2    False
3    False
Name: grade, dtype: bool

In [82]:
df[df['grade'].isin(['A'])]

  name  score grade  age
0  Kim  100.0     A   20
1  Cho   95.0     A   30

In [83]:
df.loc[df['grade'].isin(['A']), ]

  name  score grade  age
0  Kim  100.0     A   20
1  Cho   95.0     A   30

In [84]:
df

   name  score grade  age
0   Kim  100.0     A   20
1   Cho   95.0     A   30
2  Choi   90.5     B   40
3    jo   85.7     B   50

In [85]:
index_name = ['김씨', '조씨', '최씨', '맹씨']
df.index = index_name

In [86]:
df

    name  score grade  age
김씨   Kim  100.0     A   20
조씨   Cho   95.0     A   30
최씨  Choi   90.5     B   40
맹씨    jo   85.7     B   50

In [88]:
df[1:3] # index이름을 변경해도 슬라이싱 시, 인덱스 번호로 통해 접근 가능

    name  score grade  age
조씨   Cho   95.0     A   30
최씨  Choi   90.5     B   40

In [89]:
df['조씨':'최씨']

    name  score grade  age
조씨   Cho   95.0     A   30
최씨  Choi   90.5     B   40